import React from 'react';
import Feature from '../../components/feature/Feature';
import './features.css';

const featuresData = [
  {
    title: 'სამომხმარებლო სესხი',
    text: 'აიღე სამომხამრებლო სესხი რამდენიმე წუთში ან უბრალოდ შეამოწმე შენი ლიმიტი და გაიაქტიურე სესხი ნებისმიერ დროს.',
  },
  {
    title: 'იპოთეკური სესხი',
    text: ' გამოიყენე შესაძლებლობა და ისარგებლე სპეციალურად შენზე მორგებული იპოთეკური სესხით. დღესვე შეარჩიე სასურველი ბინა, ან მოითხოვე თანხა რემონტისთვის მარტივად.',
  },
  {
    title: 'ონლაინ განვადება',
    text: 'თუ ნივთის შეძენა გსურს, მაგრამ ჩვენამდე მოსვლას ვერ ახერხებ, მაშინ შეგიძლია, ტერაბანკის პარტნიორი მაღაზიების ვებგვერდს ესტუმრო და ონლაინ განვადების განაცხადი დისტანციურად, უსაფრთხოდ და კიდევ უფრო კომფორტულად შეავსო.',
  },
  {
    title: 'იპოთეკური ლიზინგი',
    text: 'იპოთეკური ლიზინგით სარგებლობისთვის საკმარისია,  ლარში აქტივის ღირებულების მინიმუმ 5%, უცხოურ ვალუტაში კი - 10% წარადგინო. სასურველ ქონებას დეველოპერისგან სალიზინგო კომპანია შეიძენს და შესაბამისი ხელშეკრულებით გადმოგცემს.',
  },
];

const Features = () => (
  <div className="tera__features section__padding" id="features">
    <div className="tera__features-heading">
      <h1 className="gradient__text">შეადარე სესხები ერთმანეთს ძირითადი პარამეტრების საშუალებით და აირჩიე შენს სურვილებსა და შესაძლებლობებზე მაქსიმალურად მორგებული.</h1>
      <p>განაცხადი შეგიძლიათ გააკეთოთ როგოც ბანკში ასევე ონლაინ</p>
    </div>
    <div className="tera__features-container">
      {featuresData.map((item, index) => (
        <Feature title={item.title} text={item.text} key={item.title + index} />
      ))}
    </div>
  </div>
);

export default Features;
